# 02.DataFrame

- 엑셀의 표 형태로 구성된 데이터 분석의 가장 기본적인 자료 구조
- **열**과 **행**로 구성된다.
    - **열** : column 이나 변수라고 부른다.
    - **행** : row 나 index 라고 부른다.
- `열 > 행` 순으로 값에 접근한다.

## #1. 필수 패키지 참조

### 1) xlsx 파일을 불러오기 위한 의존성 설치
엑셀 파일로 부터 DataFrame 을 생성하기 위해서는 
pandas 모듈 내의 ExcelFile 클래스가 의존하는 모듈들을 추가적으로 설치해야한다.
```
    pip install --upgrade openpyxl
    pip install --upgrade xlrd
```

In [1]:
from pandas import DataFrame
from pandas import read_csv
from pandas import ExcelFile

## #2. 데이터프레임을 생성하기
리턴 받을 객체 = DataFrame(데이터, index=[인덱스이름을 위한 리스트], columns=[컬럼이름을 위한 리스트])

### 1) 데이터의 종류
1. 2차원 리스트
2. 리스트를 원소로 갖는 딕셔너리
3. 동일한 구조를 갖는 딕셔너리들이 모인 리스트
4. csv 파일
5. xlsx 파일

### 2) 2차원 리스트를 활용한 DataFrame 생성

#### 기본생성

각각의 1차원 리스트를 DataFrame 에서 하나의 행으로 지정

컬럼과 인덱스 이름은 0 부터 순차적으로 일련번호가 부여된다.

> DataFrame 에서 빈값은 None 으로 지정한다.<br>
이는 조사과정에서 측정되지 않은 상태를 의미하며,<br>
이러한 형태의 빈 값을 **결측치**라고 한다.

In [2]:
source = [
    [1, '남자', 98,88,64] ,
    [2, '여자', 88,90,62,72] ,
    [1, '남자', 92,70,None,None] ,
    [3, '여자', 63,60,31,70] ,
    [4, '남자', 120,50,None,88]
]
df = DataFrame(source)
df

   0   1    2   3     4     5
0  1  남자   98  88  64.0   NaN
1  2  여자   88  90  62.0  72.0
2  1  남자   92  70   NaN   NaN
3  3  여자   63  60  31.0  70.0
4  4  남자  120  50   NaN  88.0

#### 컬럼과 인덱스 이름 지정하기

In [3]:
df = DataFrame(source, 
               index=['철수','영희','민수','수현','호영'],
               columns=['학년','성별','국어','영어','수학','과학'])
df

    학년  성별   국어  영어    수학    과학
철수   1  남자   98  88  64.0   NaN
영희   2  여자   88  90  62.0  72.0
민수   1  남자   92  70   NaN   NaN
수현   3  여자   63  60  31.0  70.0
호영   4  남자  120  50   NaN  88.0

### 3) 리스트를 원소로 갖는 딕셔너리를 사용한 DataFrame 생성

딕셔너리의 `key` 가 `컬럼의 이름`으로 사용되기 때문에 `index` 만 `추가`적으로 지정한다.

In [4]:
source = {
    '학년' : [1,2,1,3,4],
    '성별' : ['남자','여자','남자','여자','남자'],
    '국어' : [98,88,92,63,120],
    '영어' : [88,90,70,60,50],
    '수학' : [64,62,None,31,None],
    '과학' : [None,72,None,70,88]
}

df = DataFrame(source,index=['철수','영희','민수','수현','호영'])
df

    학년  성별   국어  영어    수학    과학
철수   1  남자   98  88  64.0   NaN
영희   2  여자   88  90  62.0  72.0
민수   1  남자   92  70   NaN   NaN
수현   3  여자   63  60  31.0  70.0
호영   4  남자  120  50   NaN  88.0

### 4) `동일한 구조`를 갖는 딕셔너리들이 모인 리스트를 사용한 DataFrame 생성
딕셔너리의 **key** 가 `컬럼의 이름`으로 사용되기 때문에 **index** 만 `추가`적으로 지정한다.

In [5]:
source = [
    {'학년':1, '성별':'남자', '국어':98, '영어':88,'수학':64,'과학':None},
    {'학년':2, '성별':'여자', '국어':88, '영어':90,'수학':62,'과학':72},
    {'학년':1, '성별':'남자', '국어':92, '영어':70,'수학':None,'과학':None},
    {'학년':3, '성별':'여자', '국어':63, '영어':60,'수학':31,'과학':70},
    {'학년':4, '성별':'남자', '국어':120, '영어':50,'수학':None,'과학':88},
]
df = DataFrame(source,index=['철수','영희','민수','수현','호영'])
df

    학년  성별   국어  영어    수학    과학
철수   1  남자   98  88  64.0   NaN
영희   2  여자   88  90  62.0  72.0
민수   1  남자   92  70   NaN   NaN
수현   3  여자   63  60  31.0  70.0
호영   4  남자  120  50   NaN  88.0

### 5) CSV 파일을 DataFrame 으로 변환하기

#### 리턴받을 객체 = read_csv("파일경로", encoding="euc-kr | utf-8")

* `encoding` 의 기본값은 `utf-8`
    - MS-Office 2019 미만 버전에서 생성한 경우, 무조건 `euc-kr`
      
> 외부에서 csv 나 xlsx 파일을 가져오는 경우, index 가 인식되지 않기 때문에 <br>
특정 컬럼 값들을 index 로 지정하고, 그 컬럼을 삭제하는 전처리가 필요하다.(나중에..)

In [6]:
df1 = read_csv('grade.csv', encoding="euc-kr")
df1

   이름  학년  성별   국어    영어    수학    과학
0  철수   1  남자   98   NaN  88.0  64.0
1  영희   2  여자   88  90.0  62.0  72.0
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0

#### 서버에서 불러오기(Spring mvc 기준, webapp 안에 resources 안에 data 폴더 만들고 데이터 넣기)

In [7]:
df = read_csv("http://localhost:8090/resources/data/grade.csv", encoding="euc-kr")
df

   이름  학년  성별   국어    영어    수학    과학
0  철수   1  남자   98   NaN  88.0  64.0
1  영희   2  여자   88  90.0  62.0  72.0
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0

In [8]:
!pip install --upgrade openpyxl
!pip install --upgrade xlrd
!pip install --upgrade pandas

Requirement already satisfied: openpyxl in c:\users\ict05-17\anaconda3\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\ict05-17\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: xlrd in c:\users\ict05-17\anaconda3\lib\site-packages (2.0.1)
Requirement already satisfied: pandas in c:\users\ict05-17\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in c:\users\ict05-17\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ict05-17\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\ict05-17\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ict05-17\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\ict05-17\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

### 6) xlsx 파일을 DataFrame 으로 변환하기

#### 1. 엑셀파일을 객체 형태로 가져온다.

In [9]:
xls1 = ExcelFile('grade.xlsx')
xls1

#### 2. 가져온 엑셀 객체를 데이터프레임으로 변환하기(sheet 이름 또는 index 사용)

In [10]:
# 시트 인덱스 사용
df = xls1.parse(xls1.sheet_names[0])
df

   이름  학년  성별   국어    영어    수학    과학
0  철수   1  남자   98   NaN  88.0  64.0
1  영희   2  여자   88  90.0  62.0  72.0
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0

In [11]:
# 시트 이름 사용
df = xls1.parse('grade')
df

   이름  학년  성별   국어    영어    수학    과학
0  철수   1  남자   98   NaN  88.0  64.0
1  영희   2  여자   88  90.0  62.0  72.0
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0

## #3. 데이터에 접근하기

### 1) 데이터 개요 확인

#### 데이터의 크기

>튜플 타입으로 행과 열의 크기가 반환된다. (행, 열)

In [12]:
size = df.shape
size

(5, 7)

#### 튜플 이므로 행과 열을 구성하는 변수로 나눠서 저장 가능

In [13]:
rows, cols = df.shape
print(rows)
print(cols)

5
7

### 2) 상위 N건 확인하기
#### 파라미터 숫자 만큼 확인 가능, 파라미터 숫자가 없으면 기본값 5건 확인

In [14]:
top = df.head(3)
top

   이름  학년  성별  국어    영어    수학    과학
0  철수   1  남자  98   NaN  88.0  64.0
1  영희   2  여자  88  90.0  62.0  72.0
2  민수   1  남자  92  70.0   NaN   NaN

### 3) 하위 N건 확인하기
#### 파라미터 숫자 만큼 확인 가능, 파라미터 숫자가 없으면 기본값 5건 확인

In [15]:
tail = df.tail(3)
tail

   이름  학년  성별   국어    영어    수학    과학
2  민수   1  남자   92  70.0   NaN   NaN
3  수현   3  여자   63  60.0  31.0  70.0
4  호영   4  남자  120  50.0   NaN  88.0

### 4) 인덱스 이름 확인하고, 리스트로 변환

In [16]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
i_list = list(df.index)
i_list

[0, 1, 2, 3, 4]

### 5) 컬럼 이름 확인하고, 리스트로 변환

In [18]:
df.columns

Index(['이름', '학년', '성별', '국어', '영어', '수학', '과학'], dtype='object')

In [19]:
c_list = list(df.columns)
c_list

['이름', '학년', '성별', '국어', '영어', '수학', '과학']

### 6) 데이터의 값들만 확인하고, 리스트로 변환
#### 2차원 배열로 반환된다.

In [20]:
df.values

array([['철수', 1, '남자', 98, nan, 88.0, 64.0],
       ['영희', 2, '여자', 88, 90.0, 62.0, 72.0],
       ['민수', 1, '남자', 92, 70.0, nan, nan],
       ['수현', 3, '여자', 63, 60.0, 31.0, 70.0],
       ['호영', 4, '남자', 120, 50.0, nan, 88.0]], dtype=object)

In [21]:
type(df.values)

numpy.ndarray

### 7) 전치 구하기

#### 행과 열이 서로 바뀐 형태

In [22]:
df_t = df.T
df_t

       0     1     2     3     4
이름    철수    영희    민수    수현    호영
학년     1     2     1     3     4
성별    남자    여자    남자    여자    남자
국어    98    88    92    63   120
영어   NaN  90.0  70.0  60.0  50.0
수학  88.0  62.0   NaN  31.0   NaN
과학  64.0  72.0   NaN  70.0  88.0

### 8) 각 `열`단위 데이터 접근
#### 각 열마다 데이터타입 확인하기

In [23]:
df.dtypes

이름     object
학년      int64
성별     object
국어      int64
영어    float64
수학    float64
과학    float64
dtype: object

#### 특정 열에 대한 데이터타입과 값 확인하기
> 데이터프레임에서 열은 시리즈 이다.

In [24]:
df["국어"]

0     98
1     88
2     92
3     63
4    120
Name: 국어, dtype: int64

In [25]:
type(df['국어'])

pandas.core.series.Series

#### 특정 열의 값들을 numpy 배열로 변환

In [26]:
arr = df['국어'].values
print(arr, type(arr))

[ 98  88  92  63 120] <class 'numpy.ndarray'>

#### 특정 열의 값들을 리스트로 변환

In [27]:
lis = list(df['국어'])
print(lis, type(lis))

[98, 88, 92, 63, 120] <class 'list'>

### 9) 각 행 단위 데이터 접근
> 반드시 `loc`이라는 속성을 통해서 접근해야 한다.<br>
> 데이터프레임에서 행도 `시리즈`이다.

In [28]:
cs = df.loc[0]
cs

이름      철수
학년       1
성별      남자
국어      98
영어     NaN
수학    88.0
과학    64.0
Name: 0, dtype: object

In [29]:
type(cs)

pandas.core.series.Series

#### 특정 행의 값들을 numpy 배열로 변환

#### 특정 행의 값들을 리스트로 변환